Revit 2027 API
DialogBoxData Properties
The DialogBoxData type exposes the following members.
Properties
Name | Description
HelpId |  An ID that represents the dialog that has been displayed.
IsReadOnly | Identifies if the object is read-only or modifiable.
(Inherited from APIObject)
Top
See Also
Reference
DialogBoxData Class
Autodesk.Revit.UI.Events Namespace